In [1]:
import pandas as pd

df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=['a','b','c'], index=['A','B','C'])
df.head()

   a  b  c
A  1  2  3
B  4  5  6
C  7  8  9

# DATAFRAME SUMMARY

In [2]:
df.tail(2)

   a  b  c
B  4  5  6
C  7  8  9

In [3]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [4]:
df.index.tolist()

['A', 'B', 'C']

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [6]:
df.describe()

         a    b    c
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [7]:
df.nunique()

a    3
b    3
c    3
dtype: int64

In [8]:
df.shape

(3, 3)

In [9]:
df.size

9

# DATA LOADING

In [10]:
coffee = pd.read_csv('./warmup-data/coffee.csv')

In [11]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [12]:
results = pd.read_parquet('./data/results.parquet')

In [13]:
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [14]:
olympics_data = pd.read_excel('./data/olympics-data.xlsx', sheet_name='results')

In [15]:
olympics_data.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [16]:
bios = pd.read_csv('./data/bios.csv')

In [17]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

# DATA ACCESS

In [18]:
coffee.head(10)

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30
8     Friday    Espresso          45
9     Friday       Latte          35

In [19]:
coffee.sample(5)

          Day Coffee Type  Units Sold
13     Sunday       Latte          35
12     Sunday    Espresso          45
6    Thursday    Espresso          40
9      Friday       Latte          35
5   Wednesday       Latte          25

In [20]:
coffee.loc[[0, 1, 2]]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [21]:
coffee.loc[0:2]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [22]:
coffee.loc[0:2,['Units Sold']]

   Units Sold
0          25
1          15
2          30

In [23]:
coffee.loc[0:2]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [24]:
coffee.index = coffee['Day']

In [25]:
coffee.head()

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35

In [26]:
coffee.loc['Monday']

           Day Coffee Type  Units Sold
Day
Monday  Monday    Espresso          25
Monday  Monday       Latte          15

In [27]:
coffee.loc['Wednesday':'Sunday']

                 Day Coffee Type  Units Sold
Day
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [28]:
coffee.loc['Wednesday', 'Units Sold'] = 1000

In [29]:
coffee.head(10)

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso        1000
Wednesday  Wednesday       Latte        1000
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35

In [30]:
coffee.at['Monday','Coffee Type']

Day
Monday    Espresso
Monday       Latte
Name: Coffee Type, dtype: object

In [31]:
coffee.Day

Day
Monday          Monday
Monday          Monday
Tuesday        Tuesday
Tuesday        Tuesday
Wednesday    Wednesday
Wednesday    Wednesday
Thursday      Thursday
Thursday      Thursday
Friday          Friday
Friday          Friday
Saturday      Saturday
Saturday      Saturday
Sunday          Sunday
Sunday          Sunday
Name: Day, dtype: object

# DATA MANIPULATION

In [32]:
coffee.sort_values('Units Sold', ascending=False)

                 Day Coffee Type  Units Sold
Day
Wednesday  Wednesday    Espresso        1000
Wednesday  Wednesday       Latte        1000
Saturday    Saturday    Espresso          45
Sunday        Sunday    Espresso          45
Friday        Friday    Espresso          45
Thursday    Thursday    Espresso          40
Saturday    Saturday       Latte          35
Friday        Friday       Latte          35
Sunday        Sunday       Latte          35
Tuesday      Tuesday    Espresso          30
Thursday    Thursday       Latte          30
Monday        Monday    Espresso          25
Tuesday      Tuesday       Latte          20
Monday        Monday       Latte          15

In [33]:
coffee.sort_values(['Units Sold','Coffee Type'], ascending=[0,1])

                 Day Coffee Type  Units Sold
Day
Wednesday  Wednesday    Espresso        1000
Wednesday  Wednesday       Latte        1000
Friday        Friday    Espresso          45
Saturday    Saturday    Espresso          45
Sunday        Sunday    Espresso          45
Thursday    Thursday    Espresso          40
Friday        Friday       Latte          35
Saturday    Saturday       Latte          35
Sunday        Sunday       Latte          35
Tuesday      Tuesday    Espresso          30
Thursday    Thursday       Latte          30
Monday        Monday    Espresso          25
Tuesday      Tuesday       Latte          20
Monday        Monday       Latte          15

# DATA FILTERING

In [34]:
bios.head()
bios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [35]:
bios.loc[bios['height_cm']  > 215]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5089,5108,Viktor Pankrashkin,1957-06-19,Moskva (Moscow),Moskva,RUS,Soviet Union,220.0,112.0,1993-07-24
5583,5606,Paulinho Villas Boas,1963-01-26,São Paulo,São Paulo,BRA,Brazil,217.0,106.0,NaN
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5716,5739,Uwe Blab,1962-03-26,München (Munich),Bayern,GER,Germany West Germany,218.0,110.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
5796,5819,Andy Campbell,1956-07-21,Melbourne,Victoria,AUS,Australia,218.0,93.0,NaN
6223,6250,Lars Hansen,1954-09-27,København (Copenhagen),Hovedstaden,DEN,Canada,216.0,105.0,NaN
6270,6298,Hu Zhangbao,1963-04-05,NaN,NaN,NaN,People's Republic of China,216.0,135.0,NaN
6409,6440,Sergey Kovalenko,1947-08-11,NaN,NaN,NaN,Soviet Union,216.0,111.0,2004-11-18
6420,6451,Jānis Krūmiņš,1930-01-30,Cēsis,Cēsu novads,LAT,Soviet Union,218.0,141.0,1994-11-20
6504,6537,Luc Longley,1969-01-19,Melbourne,Victoria,AUS,Australia,220.0,135.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
7074,7111,Paulo da Silva,1963-07-21,São Paulo,São Paulo,BRA,Brazil,217.0,106.0,NaN
7188,7226,Vladimir Tkachenko,1957-09-20,Golovinka,Krasnodar Kray,RUS,Soviet Union,220.0,110.0,NaN
7281,7320,Stojko Vranković,1964-01-22,Drniš,Šibensko-kninska županija,CRO,Croatia Yugoslavia,217.0,115.0,NaN
7376,7416,Eurelijus Žukauskas,1973-08-22,Klaipėda,Klaipėda,LTU,Lithuania,218.0,115.0,NaN
52608,52983,Aleksey Kazakov,1976-03-18,Naberezhnye Chelny,Respublika Tatarstan,RUS,Russian Federation,217.0,102.0,NaN
82100,82753,Frédéric Weis,1977-06-22,Thionville,Moselle,FRA,France,218.0,110.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
107408,108533,Peter John Ramos,1985-05-23,Fajardo,Puerto Rico,PUR,Puerto Rico,219.0,113.0,NaN
112312,113568,Stanko Barać,1986-08-13,Mostar,Hercegovačko-neretvanski kanton,BIH,Croatia,217.0,110.0,NaN
112332,113588,Andreas Glyniadakis,1981-08-26,Chania,Kriti,GRE,Greece,216.0,115.0,NaN
112337,113593,Hamed Haddadi,1985-05-19,Ahvaz,Khuzestan,IRI,Islamic Republic of Iran,218.0,110.0,NaN
118663,120400,Timofey Mozgov,1986-07-16,NaN,NaN,NaN,Russian Federation,216.0,113.0,NaN
118676,120415,Dmitry Musersky,1988-10-29,Makiïvka,Donetsk,UKR,Russian Federation,219.0,104.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN
121694,123709,Salah Mejri,1986-06-15,Jendouba,Jendouba,TUN,Tunisia,216.0,110.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN
130460,133147,Li Muhao,1992-06-02,Guiyang,Guizhou,CHN,People's Republic of China,218.0,115.0,NaN
130461,133148,Zhou Qi,1996-01-16,Xinxiang,Henan,CHN,People's Republic of China,217.0,95.0,NaN
138671,142084,Ondřej Balvín,1992-09-20,Ústí nad Labem,Ústecký kraj,CZE,Czechia,216.0,107.0,NaN
139365,142836,Moustapha Fall,1992-02-23,Paris,Paris,FRA,France,218.0,NaN,NaN

In [36]:
(bios['height_cm'] > 215).sum()

np.int64(35)

In [37]:
bios.loc[bios['height_cm']  > 215, ['name','height_cm']].sort_values('height_cm', ascending=False)

                         name  height_cm
89070                Yao Ming      226.0
5781           Tommy Burleson      223.0
6978          Arvydas Sabonis      223.0
120266           Zhang Zhaoxu      221.0
89075          Roberto Dueñas      221.0
5673           Gunther Behnke      221.0
5089       Viktor Pankrashkin      220.0
6504              Luc Longley      220.0
7188       Vladimir Tkachenko      220.0
118676        Dmitry Musersky      219.0
107408       Peter John Ramos      219.0
130460               Li Muhao      218.0
82100           Frédéric Weis      218.0
139365         Moustapha Fall      218.0
112337          Hamed Haddadi      218.0
6420            Jānis Krūmiņš      218.0
7376      Eurelijus Žukauskas      218.0
5796            Andy Campbell      218.0
5716                 Uwe Blab      218.0
5583     Paulinho Villas Boas      217.0
130461                Zhou Qi      217.0
112312           Stanko Barać      217.0
7281         Stojko Vranković      217.0
52608         Aleksey Kazakov      217.0
7074           Paulo da Silva      217.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6937           David Robinson      216.0
6722         Shaquille O'Neal      216.0
6409         Sergey Kovalenko      216.0
112332    Andreas Glyniadakis      216.0
118663         Timofey Mozgov      216.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
138671          Ondřej Balvín      216.0

In [38]:
bios[bios['height_cm']  > 215][['name','height_cm']]

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

In [39]:
bios[ (bios['height_cm']  > 215) & (bios['born_country'] == 'USA')][['name','height_cm']]

                    name  height_cm
5781      Tommy Burleson      223.0
6722    Shaquille O'Neal      216.0
6937      David Robinson      216.0
123850    Tyson Chandler      216.0

In [40]:
bios[bios['name'].str.contains('Akkuş|Hasan')]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1686,1693,Hasan Al,1972-06-18,Sivas,Sivas,TUR,Denmark,173.0,67.0,NaN
8297,8342,Khurshed Hasanov,1973-08-19,NaN,NaN,NaN,Tajikistan,192.0,54.0,NaN
14583,14681,Saber Mohamed Hasan,1967-07-09,NaN,NaN,NaN,Bahrain,170.0,68.0,NaN
19823,19962,Abdul Rashid Al-Hasan,1959-04-14,Gojra,Punjab,PAK,Pakistan,170.0,63.0,NaN
22688,22858,Ali Hasan,1965-05-23,NaN,NaN,NaN,Kuwait,170.0,70.0,NaN
22689,22859,Kazem Hasan,1961-02-09,NaN,NaN,NaN,Kuwait,178.0,70.0,NaN
48643,48997,Ali Al-Hasan,1973-01-04,NaN,NaN,NaN,Kuwait,NaN,NaN,NaN
48648,49002,Hasan Al-Shammari,1967-02-21,NaN,NaN,NaN,Kuwait,177.0,71.0,NaN
56462,56865,Hasan Has,1960-01-15,NaN,NaN,NaN,Türkiye,165.0,75.0,NaN
57035,57441,Hasan Isaev,1952-11-09,Bisertsi,Razgrad,BUL,Bulgaria,155.0,48.0,NaN
59871,60298,Hasan Bozbey,1928-01-01,NaN,NaN,NaN,Türkiye,NaN,NaN,NaN
59899,60327,Hasan Gemici,1927-06-15,Giresun,Giresun,TUR,Türkiye,NaN,NaN,2001-06-25
59902,60331,Hasan Güngör,1934-07-05,Acıpayam,Denizli,TUR,Türkiye,178.0,87.0,2011-10-13
59942,60373,Hasan Sevinç,1933-01-01,Zile,Tokat,TUR,Türkiye,165.0,57.0,2012-11-15
64563,65050,Mohamed Mehdi Hasan,1971-09-14,NaN,NaN,NaN,Bangladesh,167.0,60.0,NaN
82538,83194,Hasan Orbay,1979-08-14,Ankara,Ankara,TUR,Türkiye,182.0,75.0,NaN
103096,104065,Hasan Kaan Özgönenç,1976-07-27,NaN,NaN,NaN,Türkiye,177.0,75.0,NaN
113673,114972,Hasan Mahboob,1981-12-31,Kapsabet,Nandi,KEN,Bahrain,178.0,69.0,NaN
115979,117354,Hasli Amir Hasan,1977-02-22,Ipoh,Perak,MAS,Malaysia,166.0,85.0,NaN
116040,117419,Burak Hasan,1985-07-04,Melbourne,Victoria,AUS,Australia,177.0,68.0,NaN
116157,117542,Ibrahim Al-Hasan,1986-08-22,NaN,NaN,NaN,Kuwait,179.0,73.0,NaN
118471,120189,Omar Hasanin,1978-11-09,Dimashq (Damascus),Dimashq,SYR,Syrian Arab Republic,178.0,75.0,NaN
133471,136410,Hasanboy Dusmatov,1993-06-24,NaN,NaN,NaN,Uzbekistan,156.0,49.0,NaN
137920,141302,Hasan Mirza,1998-06-18,NaN,NaN,NaN,Bahrain,NaN,NaN,NaN
137921,141303,Hasan Al-Samahiji,1991-02-22,NaN,NaN,NaN,Bahrain,NaN,NaN,NaN
143323,146966,Mihraç Akkuş,2000-06-01,Iğdır,Iğdır,TUR,Türkiye,NaN,NaN,NaN

In [41]:
bios[bios['name'].str.contains('Akkuş|Hasan',regex=False) ]

Empty DataFrame
Columns: [athlete_id, name, born_date, born_city, born_region, born_country, NOC, height_cm, weight_kg, died_date]
Index: []

In [42]:
coffee.sort_values('Units Sold', ascending=False)

                 Day Coffee Type  Units Sold
Day
Wednesday  Wednesday    Espresso        1000
Wednesday  Wednesday       Latte        1000
Saturday    Saturday    Espresso          45
Sunday        Sunday    Espresso          45
Friday        Friday    Espresso          45
Thursday    Thursday    Espresso          40
Saturday    Saturday       Latte          35
Friday        Friday       Latte          35
Sunday        Sunday       Latte          35
Tuesday      Tuesday    Espresso          30
Thursday    Thursday       Latte          30
Monday        Monday    Espresso          25
Tuesday      Tuesday       Latte          20
Monday        Monday       Latte          15

In [43]:
bios.query('born_country == "USA" and height_cm > 215')[['name','height_cm']]

                    name  height_cm
5781      Tommy Burleson      223.0
6722    Shaquille O'Neal      216.0
6937      David Robinson      216.0
123850    Tyson Chandler      216.0

# COLUMN MANIPULATION

In [44]:
coffee_new = coffee
coffee_deep_copy = coffee.copy()
coffee['price'] = 4.99

In [45]:
coffee.head()

                 Day Coffee Type  Units Sold  price
Day
Monday        Monday    Espresso          25   4.99
Monday        Monday       Latte          15   4.99
Tuesday      Tuesday    Espresso          30   4.99
Tuesday      Tuesday       Latte          20   4.99
Wednesday  Wednesday    Espresso        1000   4.99

In [46]:
import numpy as np
coffee['new_price'] = np.where(coffee['Coffee Type'] == 'Espresso', 3.99, 5.99)

In [47]:
coffee.head()

                 Day Coffee Type  Units Sold  price  new_price
Day
Monday        Monday    Espresso          25   4.99       3.99
Monday        Monday       Latte          15   4.99       5.99
Tuesday      Tuesday    Espresso          30   4.99       3.99
Tuesday      Tuesday       Latte          20   4.99       5.99
Wednesday  Wednesday    Espresso        1000   4.99       3.99

In [48]:
coffee.drop(columns=['new_price'])

                 Day Coffee Type  Units Sold  price
Day
Monday        Monday    Espresso          25   4.99
Monday        Monday       Latte          15   4.99
Tuesday      Tuesday    Espresso          30   4.99
Tuesday      Tuesday       Latte          20   4.99
Wednesday  Wednesday    Espresso        1000   4.99
Wednesday  Wednesday       Latte        1000   4.99
Thursday    Thursday    Espresso          40   4.99
Thursday    Thursday       Latte          30   4.99
Friday        Friday    Espresso          45   4.99
Friday        Friday       Latte          35   4.99
Saturday    Saturday    Espresso          45   4.99
Saturday    Saturday       Latte          35   4.99
Sunday        Sunday    Espresso          45   4.99
Sunday        Sunday       Latte          35   4.99

In [49]:
coffee.drop(columns=['new_price'], inplace=True)

In [50]:
coffee.head()

                 Day Coffee Type  Units Sold  price
Day
Monday        Monday    Espresso          25   4.99
Monday        Monday       Latte          15   4.99
Tuesday      Tuesday    Espresso          30   4.99
Tuesday      Tuesday       Latte          20   4.99
Wednesday  Wednesday    Espresso        1000   4.99

In [51]:
coffee_new

                 Day Coffee Type  Units Sold  price
Day
Monday        Monday    Espresso          25   4.99
Monday        Monday       Latte          15   4.99
Tuesday      Tuesday    Espresso          30   4.99
Tuesday      Tuesday       Latte          20   4.99
Wednesday  Wednesday    Espresso        1000   4.99
Wednesday  Wednesday       Latte        1000   4.99
Thursday    Thursday    Espresso          40   4.99
Thursday    Thursday       Latte          30   4.99
Friday        Friday    Espresso          45   4.99
Friday        Friday       Latte          35   4.99
Saturday    Saturday    Espresso          45   4.99
Saturday    Saturday       Latte          35   4.99
Sunday        Sunday    Espresso          45   4.99
Sunday        Sunday       Latte          35   4.99

In [52]:
coffee_deep_copy

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso        1000
Wednesday  Wednesday       Latte        1000
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30
Friday        Friday    Espresso          45
Friday        Friday       Latte          35
Saturday    Saturday    Espresso          45
Saturday    Saturday       Latte          35
Sunday        Sunday    Espresso          45
Sunday        Sunday       Latte          35

In [53]:
coffee['revenue'] = coffee['Units Sold'] * coffee['price']

In [54]:
coffee

                 Day Coffee Type  Units Sold  price  revenue
Day
Monday        Monday    Espresso          25   4.99   124.75
Monday        Monday       Latte          15   4.99    74.85
Tuesday      Tuesday    Espresso          30   4.99   149.70
Tuesday      Tuesday       Latte          20   4.99    99.80
Wednesday  Wednesday    Espresso        1000   4.99  4990.00
Wednesday  Wednesday       Latte        1000   4.99  4990.00
Thursday    Thursday    Espresso          40   4.99   199.60
Thursday    Thursday       Latte          30   4.99   149.70
Friday        Friday    Espresso          45   4.99   224.55
Friday        Friday       Latte          35   4.99   174.65
Saturday    Saturday    Espresso          45   4.99   224.55
Saturday    Saturday       Latte          35   4.99   174.65
Sunday        Sunday    Espresso          45   4.99   224.55
Sunday        Sunday       Latte          35   4.99   174.65

In [55]:
coffee.rename(columns={'new_price': 'price'}, inplace=True)

In [56]:
coffee

                 Day Coffee Type  Units Sold  price  revenue
Day
Monday        Monday    Espresso          25   4.99   124.75
Monday        Monday       Latte          15   4.99    74.85
Tuesday      Tuesday    Espresso          30   4.99   149.70
Tuesday      Tuesday       Latte          20   4.99    99.80
Wednesday  Wednesday    Espresso        1000   4.99  4990.00
Wednesday  Wednesday       Latte        1000   4.99  4990.00
Thursday    Thursday    Espresso          40   4.99   199.60
Thursday    Thursday       Latte          30   4.99   149.70
Friday        Friday    Espresso          45   4.99   224.55
Friday        Friday       Latte          35   4.99   174.65
Saturday    Saturday    Espresso          45   4.99   224.55
Saturday    Saturday       Latte          35   4.99   174.65
Sunday        Sunday    Espresso          45   4.99   224.55
Sunday        Sunday       Latte          35   4.99   174.65

In [57]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [58]:
bios_new = bios.copy()

In [59]:
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0]
bios_new['last_name'] = bios_new['name'].str.split(' ').str[1]

In [60]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,last_name
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,Blanchy
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,Boetsch
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,Borotra
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,Brugnon
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,Canet

In [61]:
bios_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 12 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
 10  first_name    145500 non-null  object
 11  last_name     145500 non-null  object
dtypes: float64(2), int64(1), object(9)
memory usage: 13.3+ MB

In [62]:
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'])

In [63]:
bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,last_name,born_datetime
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,Blanchy,1886-12-12
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,Boetsch,1969-04-01
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,Borotra,1898-08-13
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,Brugnon,1895-05-11
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,Canet,1878-04-17
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,Luchnikova,2002-01-30
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,Merkusheva,1999-09-20
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,Smirnova,1998-05-08
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,André,Foussard,1899-05-19
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,Phillips,1913-07-15

In [64]:
bios_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 13 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   athlete_id     145500 non-null  int64
 1   name           145500 non-null  object
 2   born_date      143693 non-null  object
 3   born_city      110908 non-null  object
 4   born_region    110908 non-null  object
 5   born_country   110908 non-null  object
 6   NOC            145499 non-null  object
 7   height_cm      106651 non-null  float64
 8   weight_kg      102070 non-null  float64
 9   died_date      33940 non-null   object
 10  first_name     145500 non-null  object
 11  last_name      145500 non-null  object
 12  born_datetime  143693 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(9)
memory usage: 14.4+ MB

In [65]:
bios_new['born_year'] = bios_new['born_datetime'].dt.year

In [66]:
bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,last_name,born_datetime,born_year
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,Blanchy,1886-12-12,1886.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,Boetsch,1969-04-01,1969.0
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,Borotra,1898-08-13,1898.0
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,Brugnon,1895-05-11,1895.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,Canet,1878-04-17,1878.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,Luchnikova,2002-01-30,2002.0
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,Merkusheva,1999-09-20,1999.0
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,Smirnova,1998-05-08,1998.0
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,André,Foussard,1899-05-19,1899.0
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,Phillips,1913-07-15,1913.0

In [67]:
bios_new['born_year'] = bios_new['born_year'].astype('Int64')

In [68]:
bios_new

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name,last_name,born_datetime,born_year
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-François,Blanchy,1886-12-12,1886
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,Boetsch,1969-04-01,1969
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,Borotra,1898-08-13,1898
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,Brugnon,1895-05-11,1895
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,Canet,1878-04-17,1878
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,Luchnikova,2002-01-30,2002
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,Merkusheva,1999-09-20,1999
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,Smirnova,1998-05-08,1998
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,André,Foussard,1899-05-19,1899
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,Phillips,1913-07-15,1913

In [69]:
bios_new.to_csv('./data/bios_new.csv', index=False)

In [70]:
bios['height_category'] = pd.cut(bios['height_cm'], bins=[0, 150, 170, 190, 210, 230], labels=['very short', 'short', 'average', 'tall', 'very tall'])

In [71]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,short
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,NaN
...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,short
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,short
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,short
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,short
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,NaN

In [72]:
bios['height_category'].value_counts()

height_category
average       65392
short         31948
tall           8523
very short      638
very tall       150
Name: count, dtype: int64

In [73]:
bios['nick'] = bios['name'].apply(lambda x: "Dick" if "Richard" in x else "Dickson")

In [74]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,nick
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,NaN,Dickson
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average,Dickson
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average,Dickson
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,short,Dickson
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,NaN,Dickson
...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,short,Dickson
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,short,Dickson
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,short,Dickson
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,short,Dickson
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,NaN,Dickson

In [75]:
bios['nick'].value_counts()

nick
Dickson    145078
Dick          422
Name: count, dtype: int64

# MERGING & CONCATENATING

In [77]:
nocs = pd.read_csv("./data/noc_regions.csv")

In [78]:
nocs.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [81]:
bios_new = pd.merge(bios, nocs, left_on='born_country', right_on='NOC', how='left')

In [83]:
bios_new.rename(columns={'born_country_Full': 'born_country_full'}, inplace=True)

In [84]:
bios_new.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,nick,NOC_y,born_country_full,notes
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,NaN,Dickson,FRA,France,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average,Dickson,FRA,France,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average,Dickson,FRA,France,NaN
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,short,Dickson,FRA,France,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,NaN,Dickson,GBR,UK,NaN

In [89]:
usa_athletes = bios_new[bios_new['born_country'] == 'USA']
gbr_athletes = bios_new[bios_new['born_country'] == 'GBR']

In [90]:
usa_athletes.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,nick,NOC_y,born_country_full,notes
54,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN,average,Dickson,USA,USA,NaN
960,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN,short,Dickson,USA,USA,NaN
961,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN,short,Dickson,USA,USA,NaN
1231,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20,NaN,Dickson,USA,USA,NaN
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN,short,Dickson,USA,USA,NaN

In [91]:
gbr_athletes.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,nick,NOC_y,born_country_full,notes
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,NaN,Dickson,GBR,UK,NaN
37,38,Helen Aitchison,1881-12-06,Sunderland,England,GBR,Great Britain,NaN,NaN,1947-05-26,NaN,Dickson,GBR,UK,NaN
38,39,Geraldine Beamish,1883-06-23,Forest Gate,England,GBR,Great Britain,NaN,NaN,1972-05-10,NaN,Dickson,GBR,UK,NaN
39,40,Dora Boothby,1881-08-02,Finchley,England,GBR,Great Britain,NaN,NaN,1970-02-22,NaN,Dickson,GBR,UK,NaN
40,41,Julie Bradbury,1967-02-12,Oxford,England,GBR,Great Britain,175.0,64.0,NaN,average,Dickson,GBR,UK,NaN

In [92]:
anglo_athletes = pd.concat([usa_athletes, gbr_athletes], ignore_index=True)
anglo_athletes.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC_x,height_cm,weight_kg,died_date,height_category,nick,NOC_y,born_country_full,notes
0,55,Monique Javer,1967-07-22,Burlingame,California,USA,Great Britain,177.0,64.0,NaN,average,Dickson,USA,USA,NaN
1,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN,short,Dickson,USA,USA,NaN
2,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN,short,Dickson,USA,USA,NaN
3,1238,Bert Schneider,1897-07-01,Cleveland,Ohio,USA,Canada,NaN,NaN,1986-02-20,NaN,Dickson,USA,USA,NaN
4,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN,short,Dickson,USA,USA,NaN

In [94]:
usa_athletes.count()

athlete_id           9641
name                 9641
born_date            9641
born_city            9641
born_region          9641
born_country         9641
NOC_x                9641
height_cm            7762
weight_kg            7388
died_date            3036
height_category      7762
nick                 9641
NOC_y                9641
born_country_full    9641
notes                   0
dtype: int64

In [95]:
gbr_athletes.count()

athlete_id           5792
name                 5792
born_date            5792
born_city            5792
born_region          5792
born_country         5792
NOC_x                5792
height_cm            3608
weight_kg            3424
died_date            2443
height_category      3608
nick                 5792
NOC_y                5792
born_country_full    5792
notes                   0
dtype: int64

In [96]:
anglo_athletes.count()

athlete_id           15433
name                 15433
born_date            15433
born_city            15433
born_region          15433
born_country         15433
NOC_x                15433
height_cm            11370
weight_kg            10812
died_date             5479
height_category      11370
nick                 15433
NOC_y                15433
born_country_full    15433
notes                    0
dtype: int64

In [97]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,nick
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,NaN,Dickson
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average,Dickson
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average,Dickson
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,short,Dickson
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,NaN,Dickson

In [98]:
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [100]:
combined_df = pd.merge(results, bios, on='athlete_id',how='left')

In [101]:
combined_df.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,...,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,nick
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,...,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,NaN,Dickson
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,...,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,NaN,Dickson
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,...,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,NaN,Dickson
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,...,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,NaN,Dickson
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,...,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,NaN,Dickson

# HANDLING NULL VALUES

In [113]:
coffee = pd.read_csv('./warmup-data/coffee.csv')
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [114]:
coffee.loc[[1,2], 'Units Sold'] = np.nan
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso        25.0
1     Monday       Latte         NaN
2    Tuesday    Espresso         NaN
3    Tuesday       Latte        20.0
4  Wednesday    Espresso        35.0

In [122]:
coffee['Units Sold'].interpolate(method='linear', inplace=False)

0     25.000000
1     23.333333
2     21.666667
3     20.000000
4     35.000000
5     25.000000
6     40.000000
7     30.000000
8     45.000000
9     35.000000
10    45.000000
11    35.000000
12    45.000000
13    35.000000
Name: Units Sold, dtype: float64

In [126]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte         NaN
2     Tuesday    Espresso         NaN
3     Tuesday       Latte        20.0
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday    Espresso        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [128]:
coffee.loc[[2,8],'Coffee Type'] = np.nan

In [129]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte         NaN
2     Tuesday         NaN         NaN
3     Tuesday       Latte        20.0
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
8      Friday         NaN        45.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [130]:
coffee.dropna(subset=['Coffee Type'], inplace=True)
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte         NaN
3     Tuesday       Latte        20.0
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [131]:
coffee[coffee['Units Sold'].isna()]

      Day Coffee Type  Units Sold
1  Monday       Latte         NaN

In [133]:
coffee[coffee['Units Sold'].notna()]

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
3     Tuesday       Latte        20.0
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

# AGGREGATING DATA

In [143]:
bios['born_country'].value_counts()

born_country
USA       9641
GER       6891
GBR       5792
FRA       5143
ITA       4709
          ...
SEY          1
SMT          1
COK          1
Corfu        1
Aarhus       1
Name: count, Length: 236, dtype: int64

In [146]:
bios[bios['born_region']=='Ankara'].count()

athlete_id         36
name               36
born_date          36
born_city          36
born_region        36
born_country       36
NOC                36
height_cm          31
weight_kg          30
died_date          10
height_category    31
nick               36
dtype: int64

In [149]:
bios[bios['born_country'] == "USA"]['born_region'].value_counts()

born_region
California              1634
New York                 990
Illinois                 585
Massachusetts            530
Pennsylvania             530
New Jersey               381
Texas                    368
Minnesota                365
Ohio                     328
Michigan                 319
Washington               240
Florida                  235
Wisconsin                209
Colorado                 207
Connecticut              156
Indiana                  150
Oregon                   132
Georgia                  129
Virginia                 121
Maryland                 117
District of Columbia     107
Iowa                     102
Hawaiʻi                   95
Kansas                    94
Oklahoma                  93
Louisiana                 92
Utah                      91
Missouri                  91
North Carolina            86
Arizona                   83
New Hampshire             83
Vermont                   68
Mississippi               66
Alabama                   64
Kentucky                  62
Tennessee                 62
Nebraska                  60
Rhode Island              56
Montana                   55
Maine                     50
South Carolina            50
Alaska                    45
Arkansas                  42
Idaho                     41
New Mexico                38
Nevada                    36
South Dakota              27
West Virginia             24
Delaware                  22
North Dakota              16
Wyoming                   14
Name: count, dtype: int64

In [150]:
coffee['Units Sold'].interpolate(method='linear', inplace=True)

C:\Users\burha\AppData\Local\Temp\ipykernel_10368\623118376.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  coffee['Units Sold'].interpolate(method='linear', inplace=True)

In [151]:
coffee

          Day Coffee Type  Units Sold
0      Monday    Espresso        25.0
1      Monday       Latte        22.5
3     Tuesday       Latte        20.0
4   Wednesday    Espresso        35.0
5   Wednesday       Latte        25.0
6    Thursday    Espresso        40.0
7    Thursday       Latte        30.0
9      Friday       Latte        35.0
10   Saturday    Espresso        45.0
11   Saturday       Latte        35.0
12     Sunday    Espresso        45.0
13     Sunday       Latte        35.0

In [153]:
coffee.groupby('Coffee Type')['Units Sold'].sum()

Coffee Type
Espresso    190.0
Latte       202.5
Name: Units Sold, dtype: float64

In [154]:
coffee['price'] = coffee['Coffee Type'].map({'Espresso': 3.99, 'Latte': 4.99, 'Cappuccino': 5.99})

In [156]:
coffee['revenue'] = coffee.apply(lambda x: x['Units Sold'] * x['price'], axis=1)
coffee

          Day Coffee Type  Units Sold  price  revenue
0      Monday    Espresso        25.0   3.99   99.750
1      Monday       Latte        22.5   4.99  112.275
3     Tuesday       Latte        20.0   4.99   99.800
4   Wednesday    Espresso        35.0   3.99  139.650
5   Wednesday       Latte        25.0   4.99  124.750
6    Thursday    Espresso        40.0   3.99  159.600
7    Thursday       Latte        30.0   4.99  149.700
9      Friday       Latte        35.0   4.99  174.650
10   Saturday    Espresso        45.0   3.99  179.550
11   Saturday       Latte        35.0   4.99  174.650
12     Sunday    Espresso        45.0   3.99  179.550
13     Sunday       Latte        35.0   4.99  174.650

In [159]:
pivot_table = coffee.pivot_table(columns='Coffee Type', index='Day', values='revenue')
pivot_table

Coffee Type  Espresso    Latte
Day
Friday            NaN  174.650
Monday          99.75  112.275
Saturday       179.55  174.650
Sunday         179.55  174.650
Thursday       159.60  149.700
Tuesday           NaN   99.800
Wednesday      139.65  124.750

In [173]:
bios['born_date'] = pd.to_datetime(bios['born_date'])
bios.groupby(bios['born_date'].dt.month)['name'].count().reset_index().sort_values('name')

    born_date   name
10       11.0  10766
11       12.0  11036
9        10.0  11303
5         6.0  11328
7         8.0  11491
8         9.0  11605
6         7.0  11745
1         2.0  11974
3         4.0  12021
4         5.0  12183
2         3.0  12831
0         1.0  15410